{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "signature": {"outputs": {"output": {"name": "output"}}}, "modelTopology": {"node": [{"name": "CNN2/prelu/Mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "CNN1/prelu/Mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "CNN1/conv_W", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "CNN1/conv_B", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "CNN2/conv_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "4"}, {"size": "4"}]}}}}}, {"name": "CNN2/conv_B", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "dropout_keep_rate", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "Concat/H_concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Up-PS/Up-PS_CNN/conv_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "32"}]}}}}}, {"name": "Up-PS/Up-PS_CNN/conv_B", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "R-CNN1/conv_W", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "1"}]}}}}}, {"name": "x", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}}, {"name": "x2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "CNN1/CNN1_conv", "op": "Conv2D", "input": ["x", "CNN1/conv_W"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "CNN1/CNN1_add", "op": "Add", "input": ["CNN1/CNN1_conv", "CNN1/conv_B"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN1/prelu/Relu", "op": "Relu", "input": ["CNN1/CNN1_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN1/prelu/Abs", "op": "Abs", "input": ["CNN1/CNN1_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN1/prelu/sub", "op": "Sub", "input": ["CNN1/CNN1_add", "CNN1/prelu/Abs"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN1/prelu/mul_1", "op": "Mul", "input": ["CNN1/prelu/Mul", "CNN1/prelu/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN1/prelu/add", "op": "Add", "input": ["CNN1/prelu/Relu", "CNN1/prelu/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN1/dropout/Shape", "op": "Shape", "input": ["CNN1/prelu/add"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "CNN1/dropout/div", "op": "RealDiv", "input": ["CNN1/prelu/add", "dropout_keep_rate"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN1/dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["CNN1/dropout/Shape"], "attr": {"seed": {"i": "0"}, "seed2": {"i": "0"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "CNN1/dropout/add", "op": "Add", "input": ["CNN1/dropout/random_uniform/RandomUniform", "dropout_keep_rate"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN1/dropout/Floor", "op": "Floor", "input": ["CNN1/dropout/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN1/dropout/mul", "op": "Mul", "input": ["CNN1/dropout/Floor", "CNN1/dropout/div"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN2/CNN2_conv", "op": "Conv2D", "input": ["CNN1/dropout/mul", "CNN2/conv_W"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "CNN2/CNN2_add", "op": "Add", "input": ["CNN2/CNN2_conv", "CNN2/conv_B"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN2/prelu/Relu", "op": "Relu", "input": ["CNN2/CNN2_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN2/prelu/Abs", "op": "Abs", "input": ["CNN2/CNN2_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN2/prelu/sub", "op": "Sub", "input": ["CNN2/CNN2_add", "CNN2/prelu/Abs"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN2/prelu/mul_1", "op": "Mul", "input": ["CNN2/prelu/Mul", "CNN2/prelu/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN2/prelu/add", "op": "Add", "input": ["CNN2/prelu/Relu", "CNN2/prelu/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN2/dropout/Shape", "op": "Shape", "input": ["CNN2/prelu/add"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "CNN2/dropout/div", "op": "RealDiv", "input": ["CNN2/prelu/add", "dropout_keep_rate"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN2/dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["CNN2/dropout/Shape"], "attr": {"dtype": {"type": "DT_FLOAT"}, "T": {"type": "DT_INT32"}, "seed2": {"i": "0"}, "seed": {"i": "0"}}}, {"name": "CNN2/dropout/add", "op": "Add", "input": ["CNN2/dropout/random_uniform/RandomUniform", "dropout_keep_rate"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN2/dropout/Floor", "op": "Floor", "input": ["CNN2/dropout/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "CNN2/dropout/mul", "op": "Mul", "input": ["CNN2/dropout/Floor", "CNN2/dropout/div"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Concat/H_concat", "op": "ConcatV2", "input": ["CNN1/dropout/mul", "CNN2/dropout/mul", "Concat/H_concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Up-PS/Up-PS_CNN/Up-PS_CNN_conv", "op": "Conv2D", "input": ["Concat/H_concat", "Up-PS/Up-PS_CNN/conv_W"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Up-PS/Up-PS_CNN/Up-PS_CNN_add", "op": "Add", "input": ["Up-PS/Up-PS_CNN/Up-PS_CNN_conv", "Up-PS/Up-PS_CNN/conv_B"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Up-PS/DepthToSpace", "op": "DepthToSpace", "input": ["Up-PS/Up-PS_CNN/Up-PS_CNN_add"], "attr": {"block_size": {"i": "2"}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "R-CNN1/R-CNN1_conv", "op": "Conv2D", "input": ["Up-PS/DepthToSpace", "R-CNN1/conv_W"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "output", "op": "Add", "input": ["R-CNN1/R-CNN1_conv", "x2"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "CNN2/prelu/Mul", "shape": [4], "dtype": "float32"}, {"name": "CNN1/prelu/Mul", "shape": [4], "dtype": "float32"}, {"name": "CNN1/conv_W", "shape": [3, 3, 1, 4], "dtype": "float32"}, {"name": "CNN1/conv_B", "shape": [4], "dtype": "float32"}, {"name": "CNN2/conv_W", "shape": [3, 3, 4, 4], "dtype": "float32"}, {"name": "CNN2/conv_B", "shape": [4], "dtype": "float32"}, {"name": "Concat/H_concat/axis", "shape": [], "dtype": "int32"}, {"name": "Up-PS/Up-PS_CNN/conv_W", "shape": [3, 3, 8, 32], "dtype": "float32"}, {"name": "Up-PS/Up-PS_CNN/conv_B", "shape": [32], "dtype": "float32"}, {"name": "R-CNN1/conv_W", "shape": [3, 3, 8, 1], "dtype": "float32"}]}]}